#pragma once

#include "figure.hpp"
#include <cmath>

namespace ssu::figure {

static const Figure HARE = {
    // clang-format off
    .vertices = {
        // голова
        0.5f, 3.f, 1.f, 4.5f,    // от левой щеки вверх до уха
        1.f, 4.5f, 0.5f, 6.f,    // левое ухо слева снизу вверх
        0.5f, 6.f, 0.5f, 7.5f,   // левое ухо слева
        0.5f, 7.5f, 1.f, 8.f,    // левое ухо верх слева
        1.f, 8.f, 1.5f, 8.f,     // левое ухо верх середина
        1.5f, 8.f, 2.f, 7.5f,    // левое ухо верх справа
        2.f, 7.5f, 1.5f, 6.f,    // левое ухо справа сверху вниз
        1.5f, 6.f, 1.5f, 4.5f,   // левое ухо справа до макушки
        1.5f, 4.5f, 3.f, 4.5f,   // макушка
        3.f, 4.5f, 3.f, 6.f,     // правое ухо слева снизу вверх
        3.f, 6.f, 2.5f, 7.5f,    // правое ухо слева
        2.5f, 7.5f, 3.f, 8.f,    // правое ухо верх слева
        3.f, 8.f, 3.5f, 8.f,     // правое ухо верх середина
        3.5f, 8.f, 4.f, 7.5f,    // правое ухо верх справа
        4.f, 7.5f, 4.f, 6.f,     // правое ухо сверху вниз
        4.f, 6.f, 3.5f, 4.5f,    // правое ухо справа
        3.5f, 4.5f, 4.f, 3.f,    // от правого уха вниз до щеки
        4.f, 3.f, 3.5f, 1.5f,    // правая скула
        3.5f, 1.5f, 2.5f, 1.f,   // подбородок справа
        2.5f, 1.f, 2.f, 1.f,     // подбородок снизу
        2.f, 1.f, 1.f, 1.5f,     // подбородок слева
        1.f, 1.5f, 0.5f, 3.f,    // левая скула

        // туловище
        4.f, 3.f, 5.5f, 3.5f,    // спина от головы вправо
        5.5f, 3.5f, 7.f, 3.5f,   // спина верх
        7.f, 3.5f, 7.5f, 2.5f,   // спина сверху до хвоста
        7.5f, 2.5f, 8.f, 2.5f,   // хвост сверху
        8.f, 2.5f, 8.f, 2.f,     // хвост справа
        8.f, 2.f, 7.5f, 2.f,     // хвост низ справа налево
        7.5f, 2.f, 7.5f, 0.5f,   // задняя нога справа сверху вниз
        7.5f, 0.5f, 6.5f, 0.5f,  // задняя нога низ
        6.5f, 0.5f, 6.5f, 1.f,   // задняя нога слева
        6.5f, 1.f, 6.f, 1.f,     // между задних ног
        6.f, 1.f, 6.f, 0.5f,     // левая задняя нога справа
        6.f, 0.5f, 5.f, 0.5f,    // левая задняя нога низ
        5.f, 0.5f, 5.f, 1.f,     // левая задняя нога слева
        5.f, 1.f, 4.f, 1.f,      // между задними и передними ногами
        4.f, 1.f, 4.f, 0.5f,     // правая передняя нога справа
        4.f, 0.5f, 3.f, 0.5f,    // правая передняя нога низ
        3.f, 0.5f, 3.f, 1.f,     // правая передняя нога слева
        3.f, 1.f, 2.5f, 1.f,     // между передних ног
        2.5f, 1.f, 2.5f, 0.5f,   // передняя нога справа
        2.5f, 0.5f, 1.5f, 0.5f,  // передняя нога низ
        1.5f, 0.5f, 1.5f, 1.25f, // передняя нога слева

        // левый глаз
        1.5f, 3.5f, 1.5f, 3.f,   // левый глаз слева сверху вниз
        1.5f, 3.f, 2.f, 3.f,     // левый глаз низ
        2.f, 3.f, 2.f, 3.5f,     // левый глаз справа
        2.f, 3.5f, 1.5f, 3.5f,   // левый глаз верх
        
        // правый глаз
        2.5f, 3.5f, 2.5f, 3.f,   // правый глаз слева
        2.5f, 3.f, 3.f, 3.f,     // правый глаз снизу
        3.f, 3.f, 3.f, 3.5f,     // правый глаз справа
        3.f, 3.5f, 2.5f, 3.5f,   // правый глаз сверху
        
        // ушные раковины
        1.f, 5.5f, 1.f, 7.f,     // левая ушная раковина
        3.5f, 5.5f, 3.5f, 7.f,   // правая ушная раковина
        
        // нос
        2.f, 2.5f, 2.5f, 2.5f, // нос сверху
        2.5f, 2.5f, 2.25f, 2.f, // нос справа
        2.25f, 2.f, 2.f, 2.5f // нос слева
    },
    // clang-format on
    .Vx = 8.5f,
    .Vy = 8.5f,
};
static const Figure SLOW = {
    // clang-format off
    .vertices = {
        2.5, 0.5, 2, 1,
        2, 1, 2.5, 2,
        2.5, 2, 2, 3.5,
        2, 3.5, 0.5, 3.5,
        0.5, 3.5, 2, 4,
        2, 4, 2, 3.5,
        2, 4, 2, 4.5,
        2, 4.5, 2.5, 5.5,
        2.5, 5.5, 3, 6,
        3, 6, 1, 6.5,
        1, 6.5, 1, 8,
        1, 8, 1.5, 9,
        1.5, 9, 2.5, 10,
        2.5, 10.f, 3, 10., // верхняя точка левого уха
        3, 10, 7.5, 9,
        3, 10, 7, 8.5,
        7, 8.5, 7.5, 9,
        7, 8.5, 6.5, 7.5,
        6.5, 7.5, 7, 6.5,
        7, 6.5, 7.5, 6,
        7, 6.5, 5, 6,
        5, 6, 3, 6, // начало правого уха

        7.5, 9, 9.5, 9, // перемычка между ушами (НЕ ТРОГАТЬ БОГА РАДИ)

        7, 8.5, 6, 8.5,
        6, 8.5, 5.5, 8,
        5.5, 8, 5.5, 7.5, // начало левого уха

        9.5, 9, 13.5, 10,
        9.5, 9, 10, 8.5,
        10, 8.5, 13.5, 10,
        13.5, 10, 14, 10,
        14, 10, 14.5, 9.5, // верхняя точка правого уха
        14.5, 9.5, 14.5, 8, // вертикальная палка в ухе
        14.5, 8, 12.5, 6.5,
        12.5, 6.5, 10.5, 5.5,
        10.5, 5.5, 10, 6,
        10, 6, 10, 6.5, // переход из уха в хобот
        10, 6.5, 10.5, 7,
        10.5, 7, 10.5, 7.5,
        10.5, 7.5, 10, 8,
        10, 8, 10, 8.5,
        10, 8.5, 9.5, 8.5,
        10, 8.5, 10.5, 8.5,
        10.5, 8.5, 11, 8,
        11, 8, 11, 7.5,
        10, 8, 9.5, 7.5,
        9.5, 7.5, 10, 7, 
        10, 7, 10, 7.5,
        10, 7.5, 9.5, 7.5,
        10, 7, 10.5, 7.5,

        // левый глаз
        9, 7.5, 8.5, 8,
        8.5,8,8,7.5,
        8,7.5,8, 7,
        8,7,9,7.5,
        8.5, 7.25, 8.5, 7.5,
        8.5, 7.5, 8, 7.5,

        // левая бровь
        8, 8.5, 8.5, 8.5,
        8, 8.5, 7.5, 8,
        7.5, 8, 7.5, 7.5,

        10, 6.5, 9.5, 7, // маска
        9.5, 7, 9, 7,
        9, 7, 8, 6,

        10, 6, 10, 5.5, // хобот
        10, 5.5, 9.5, 5,
    10, 5.5, 10.5, 4.5,
        10.5, 4.5, 11, 4,
        11, 4, 11.5, 4,
        11.5, 4, 12, 3, // перемычка в хоботе 1
        11.5, 4, 12, 4.5,
        12, 4.5, 13, 4,
        13, 4, 12, 3,
        12, 3, 11, 3,
        11, 3, 8.5, 5.5,
        11, 4, 11, 3, // перемычка в хоботе 2
        10.5, 4.5, 10, 4, // перемычка в хоботе 3
        
        // вода 1
        12, 4.5, 12, 6,
        12, 6, 12.5, 5.5,
        12.5, 5.5, 12, 4.5,

        // вода 2 
        12.5, 5, 12.5, 6.,
        12.5, 6, 13, 6,
        13, 6, 12.5, 5,

        // вода 3 
        13, 5.5, 14, 6,
        14, 6, 14, 6.5,
        14, 6.5, 13.5, 6.5,
        13.5, 6.5, 13, 5.5,

        // вода 4
        13, 4.5, 14, 5.5,
        14, 5.5, 14, 5,
        14, 5, 13, 4.5,
        
        // туловище
        9, 5, 8, 3.5,
        8.5, 4.25, 8, 2,
        8, 2, 8.5, 1.5,
        8.5, 1.5, 8, 1,
        8, 1, 7, 1, 
        7, 1, 6.5, 1.5,
        6.5, 1.5, 7, 2,
        7, 2, 6.5, 3,
        6.5, 3, 7, 2.5,
        7, 2.5, 8, 3, 
        8, 3, 8, 3.5,
        8, 3.5, 7.5, 4.5,
        7.5, 4.5, 6, 5,
        6.5, 3, 6.5, 3.95,
        // 5.5, 3.5, 6.5, 4, 


        5.5, 3.5, 5.5f + (float)sqrt((45*16. - 9)/(5*64)) , 3.5f + (float)((3./4.)/((float)(sqrt(5/4.)))),

        6.5, 3, 6, 2.5,
        6, 2.5, 4.5, 2,
        4.5, 2, 5, 1.5,
        5, 1.5, 4.5, 1,
        4.5, 1, 4, 1,
        4, 1, 3.5, 2, 
        3.5, 2, 4, 3,
        3.5, 2, 4.5, 2,

        4,1, 3.5,0.5,
        3.5, 0.5, 2.5, 0.5,

        // 8, 3.5, 8, 4,
        // 8,4, 7.5, 5,


    },
    // clang-format on 
    .Vx = 15.f,
    .Vy = 10.5f,
};
}
